app/views/home/map.html.erb

SELECT "locations".* FROM "locations"
---
<script type="text/javascript">
jQuery('input[name=search]').click(function() {
  var geocoder = new google.maps.Geocoder();
    geocoder.geocode({
        address : jQuery('input[name=address]').val(),
        region: 'no'
      },
        function(results, status) {
          if (status.toLowerCase() == 'ok') {
          // Get center
          var coords = new google.maps.LatLng(
            results[0]['geometry']['location'].lat(),
            results[0]['geometry']['location'].lng()
          );

          window.hotspot.map.setCenter(coords);
          window.hotspot.map.setZoom(12);
          }
      }
    );
});