app/controllers/access_requests_controller.rb

  def approve
    request = AccessRequest.find(params[:id])
    user = User.find(request.user)
    user.role = 1
    user.save
    UserMailer.approve_email(user).deliver
    redirect_to users_url, notice: 'Request Approved.'
    request.destroy
---
SELECT "access_requests".* FROM "access_requests" WHERE "access_requests"."id" = ? LIMIT 1  [["id", "10"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "users" SET "role" = ?, "updated_at" = ? WHERE "users"."id" = 3  [["role", 1], ["updated_at", Sat, 01 Feb 2014 23:52:42 UTC +00:00]]
DELETE FROM "access_requests" WHERE "access_requests"."id" = ?  [["id", 11]]

  def create
    @access_request = AccessRequest.new(access_request_params)
    @access_request.user = current_user.id
    respond_to do |format|
      if @access_request.save
---
INSERT INTO "access_requests" ("created_at", "reason", "updated_at", "user") VALUES (?, ?, ?, ?)  [["created_at", Sat, 01 Feb 2014 23:42:38 UTC +00:00], ["reason", "sdfqwe"], ["updated_at", Sat, 01 Feb 2014 23:42:38 UTC +00:00], ["user", ""]]

  def destroy
    @access_request.destroy
---
DELETE FROM "access_requests" WHERE "access_requests"."id" = ?  [["id", 1]]

    def set_access_request
      @access_request = AccessRequest.find(params[:id])
---
SELECT "access_requests".* FROM "access_requests" WHERE "access_requests"."id" = ? LIMIT 1  [["id", "3"]]