app/controllers/administration_controller.rb

SELECT "users".* FROM "users"
SELECT "access_requests".* FROM "access_requests"
---
  def index
    if user_admin?
      @users = User.all
      @access_requests = AccessRequest.all

SELECT "users".* FROM "users" WHERE "users"."uid" = '507659810' LIMIT 1
UPDATE "users" SET "role" = ?, "updated_at" = ? WHERE "users"."id" = 3  [["role", 0], ["updated_at", Sat, 01 Feb 2014 23:52:33 UTC +00:00]]
---
  def setrole
    if user_admin?
      user = User.find_by_uid params[:id]
      begin
        role = params[:role].to_i
        if role > 2 || role < 0
          redirect_to users_url, :alert => "User update failed! Role must be between 0 and 2 (given: " + role.to_s + ")"
        else
          user.set_role(role)
          user.save