app/controllers/home_controller.rb

SELECT "locations".* FROM "locations"
---
  def map
    @locations = Location.all