app/controllers/locations_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @owner = User.find(@location.owner)

SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    location = Location.find(params[:id])

INSERT INTO "locations" ("created_at", "description", "lat", "long", "name", "owner", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    if !user_content_manager? && !user_admin?
      redirect_to root_url, :alert => "You must be a content manager to do that."
    else
      @location = Location.new(location_params)
      @location.owner = current_user.id
      respond_to do |format|
        if @location.save

SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "locations" WHERE "locations"."id" = ?  [["id", 1]]
---
  def destroy
    location = Location.find(params[:id])
    if !current_user
      redirect_to root_url, :alert => "You must log in to do that."
    elsif current_user.id != location.owner.to_i
      if !user_admin?
        redirect_to root_url, :alert => "Permission Denied."
      end
    else
      @location.destroy