app/controllers/sessions_controller.rb

  def create
    auth = request.env["omniauth.auth"]
    user = User.find_by_provider_and_uid(auth["provider"], auth["uid"]) || User.create_with_omniauth(auth)
---
INSERT INTO "users" ("created_at", "name", "provider", "role", "uid", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Fri, 17 Jan 2014 20:37:19 UTC +00:00], ["name", "Chaz Ferguson"], ["provider", "facebook"], ["role", 2], ["uid", "507659810"], ["updated_at", Fri, 17 Jan 2014 20:37:19 UTC +00:00]]
SELECT "users".* FROM "users" WHERE "users"."provider" = 'facebook' AND "users"."uid" = '507659810' LIMIT 1